БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиDICOM/НастройкиDICOM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиDICOM</name>
  <attributes>
    <name>ЗапросыDICOM_ВызываемыйAETitle</name>
    <comment>PACS</comment>
    <type>
      <types>CatalogRef.AETitles</types>
    </type>
  </attributes>
  <attributes>
    <name>STORESCP_АвтоматическийЗапуск</name>
    <comment>Автоматический запуск</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>STORESCP_ИспользуемыйAETitle</name>
    <comment>DICOM Storage AETitle</comment>
    <type>
      <types>CatalogRef.AETitles</types>
    </type>
  </attributes>
  <attributes>
    <name>STORESCP_КаталогФайлов</name>
    <comment>Каталог файлов DICOM Storage</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>STORESCP_ИспользоватьКлиент</name>
    <comment>Использовать хранилище на клиенте</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>STORESCP_ОчищатьКаталогЧерез</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MPPSDICOM_КаталогФайлов</name>
    <comment>Каталог файлов MPPS</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиDICOM/Forms/ФормаНастроекПользователя/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.НастройкиТекущегоПользователя = Истина Тогда
		ПрочитатьНастройкиПользователя(DICOMРаботаСДрайвером.ТекущийПользователь());
		Элементы.Пользователь.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Каталог = ДиалогВыбораКаталога.Каталог;
		Если Элемент.Имя = "STORESCP_КаталогФайлов" Тогда
			ЭтаФорма.Запись.STORESCP_КаталогФайлов = Каталог;
		ИначеЕсли Элемент.Имя = "MPPSDICOM_КаталогФайлов" Тогда
			ЭтаФорма.Запись.MPPSDICOM_КаталогФайлов = Каталог;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройкиПользователя(Пользователь)
	МЗ = РегистрыСведений.НастройкиDICOM.СоздатьМенеджерЗаписи();
	МЗ.Пользователь = Пользователь;
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		ЗначениеВДанныеФормы(МЗ, ЭтаФорма.Запись);
	Иначе
		ЭтаФорма.Запись.Пользователь = Пользователь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
